Repository: taminotchi4/taminotchi_mobile
Catalog: lib/core/l10n/arb/app_*.arb
Languages: uz

source: Welcome!
uz: Xush kelibsiz!

# withName
source: Hi! {name}
uz: Salom! {name}

# selectLanguage
source: Select a language
uz: Tilni tanlang

# choosePreferredLanguage
source: Choose your preferred language below. This will help us serve you better.
uz: Quyida oʻzingiz yoqtirgan tilni tanlang. Bu sizga yaxshiroq xizmat koʻrsatishimizga yordam beradi.

source: Selected
uz: Tanlangan

source: All languages
uz: Hamma tillar

# continueButton
source: Continue
uz: Davom etish

# authCreateAccount
source: Create Account
uz: Hisob ochish

# authUsername
source: Username
uz: Foydalanuvchi nomi

# authCreateUsernameHint
source: Create a username...
uz: Foydalanuvchi nomini yarating...

# authPassword
source: Password
uz: Parol

# authCreatePasswordHint
source: Create a password...
uz: Parol yarating...

# authConfirmPassword
source: Confirm Password
uz: Tasdiqlovchi Parol

# authConfirmPasswordHint
source: Confirm the password...
uz: Parolni tasdiqlang...

# authAgreementPart1
source: By signing up, you agree to the
uz: Ro‘yxatdan o‘tish orqali siz

# authAgreementPart2
source: Public Offer and the Privacy Policy
uz: Ommaviy orfeta va Maxfiylik siyosatiga

# authAgreementPart3
source: terms
uz: rozilik bildirasiz

# authPublicOffer
source: Public Offer
uz: Ommaviy orfeta

# authPrivacyPolicy
source: Privacy Policy
uz: Maxfiylik siyosati

# signUpButton
source: Sign Up
uz: Ro’yxatdan o’tish

# authSignUpWithGoogle
source: Sign up with Google
uz: Google orqali yozilish

# authAlreadyHaveAccount
source: Do you have an account?
uz: Hisobingiz bormi?

# loginButton
source: Log In
uz: Kirish

# authPasswordLengthWarning
source: Your password must be at least 6 characters long!
uz: Parolingiz kamida 6ta belgidan iborat bo‘lishi shart!

# authEnterUsernameHint
source: Enter username...
uz: Foydalanuvchi nomini kiriting...

# authEnterPasswordHint
source: Enter your password...
uz: Parolingizni kiriting...

# authForgotPassword
source: Forgot password?
uz: Parolni unutdingizmi?

# authNoAccountYet
source: Don't have an account yet?
uz: Hisobingiz hali yo’qmi?

# authInvalidUsername
source: Please enter a valid username!
uz: Iltimos, to’g’ri foydalanuvchi nomini kiriting!

# authOr
source: or
uz: yoki

# authEnterUsernameValidation
source: Please enter a username!
uz: Iltimos, foydalanuvchi nomini kiriting!

# authUsernameLengthValidation
source: Username must be at least 3 characters long
uz: Foydalanuvchi nomi kamida 3 ta belgi bo'lishi kerak

# authEnterPasswordValidation
source: Please enter a password
uz: Iltimos, Parol kiriting

# authConfirmPasswordValidation
source: Please confirm the password
uz: Iltimos, Parolni tasdiqlang

# authPasswordsNotMatch
source: Passwords do not match
uz: Parollar mos kelmadi

# authUsernameMaxLength
source: Username cannot exceed 24 characters.
uz: Foydalanuvchi nomi 24 tadan ortiq belgi bo'lishi mumkin emas.

# authUsernameCannotStartWithUnderscore
source: Username cannot start with '_'.
uz: Foydalanuvchi nomi '_' bilan boshlanishi mumkin emas.

# authUsernameCannotEndWithUnderscore
source: Username cannot end with '_'.
uz: Foydalanuvchi nomi '_' bilan tugashi mumkin emas.

# authUsernameFormat
source: Use letters, numbers, and '_'.
uz: Harflar, raqamlar va '_' dan foydalaning.

# authUsernameAllowedChars
source: Only lowercase letters (a-z), numbers (0-9), and '_' are allowed.
uz: Faqat kichik harflar (a-z), raqamlar (0-9) va '_' belgisiga ruxsat beriladi.

# authPasswordLengthRange
source: Password must be between 6 and 24 characters.
uz: Parol 6 dan 24 gacha belgi oralig'ida bo'lishi kerak.

# authPasswordMustContainNumber
source: Password must contain at least 1 number.
uz: Parolda kamida 1 ta raqam bo'lishi kerak.

# authPasswordMustContainLetter
source: Password must contain at least 1 letter.
uz: Parolda kamida 1 ta harf bo'lishi kerak.

# authLoginWithTelegram
source: Login with Telegram
uz: telegram orqali kirish

# authViaTelegram
source: via Telegram
uz: telegram orqali

source: Coming Soon
uz: tez kunda

# authUsernamePasswordSame
source: Username cannot be the same as the password.
uz: username parol bilan bir xil bo'la olmaydi.

source: Join the competition
uz: Quizzga qo‘shilish

source: Live quizzes
uz: Jonli quizlar

source: Trending quizzes
uz: Trenddagi quizlar

source: Leaderboard
uz: Yetakchilar jadvali

source: All
uz: Barchasi

source: Join
uz: Qo‘shilish

source: level
uz: daraja

source: Edit profile
uz: Profilni tahrirlash

source: Competitions
uz: Bellashuvlar

# numberOfQuizzes
source: My quizzes
uz: Quizlar soni

source: Likes
uz: Layklar

source: Add friends
uz: Do‘st qo‘shish

source: My quizzes
uz: Quizlarim

source: My favorite quizzes
uz: Yoqtirgan quizlarim

source: My statistics
uz: Statistikam

source: Profile
uz: Profil

source: Change image
uz: Rasmni o‘zgartirish

source: Full Name
uz: To'liq ism

# enterYourFirstName
source: Enter your full name...
uz: To'liq ismingizni kiriting...

source: Save
uz: Saqlash

# emptyStateTitle
source: Oops! It's empty for now
uz: Ups! Hozircha bo'sh

# emptyStateDescription
source: There are no quizzes in this category yet. Please check back later.
uz: Ushbu kategoriyada hali quizlar mavjud emas. Keyinroq qaytib ko'ring.

source: Refresh
uz: Yangilash

# internetNoConnection
source: No internet connection!
uz: Internet aloqasi yo'q!

# internetCheckConnection
source: Please check your network connection and try again.
uz: Iltimos, tarmoq ulanishini tekshiring va qayta urinib ko'ring.

source: Settings
uz: Sozlamalar

source: Connect Email
uz: Email ulash

source: Connect Telegram
uz: Telegram ulash

source: Change Password
uz: Parolni o’zgartirish

source: Privacy Settings
uz: Maxfiylik sozlamalari

source: Notifications
uz: Bildirishnomalar

source: Sound Effects
uz: Ovoz effektlari

source: Animations
uz: Animatsiyalar

source: Languages
uz: Tillar
